/** 
 * File:   Lib_H_PIC_uart.h
 * Author: Isaev
 *
 * Created on 8 октября 2017 г., 17:19
 */

#ifndef LIB_H_PIC_UART_H
#define	LIB_H_PIC_UART_H

//******************************************************************************
// Секция include (подключаем заголовочные файлы используемых модулей)
//------------------------------------------------------------------------------
//  Стандартные библиотеки языка С
#include <stdint.h>
#include <stdio.h>
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
//  Библиотеки для работы с периферией микроконтроллера
#include <xc.h>
#include <uart.h>
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
//  Внешние модули
//------------------------------------------------------------------------------
//******************************************************************************


//******************************************************************************
// Секция определения констант
//******************************************************************************


//******************************************************************************
// Секция определения типов
//******************************************************************************


//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************


//******************************************************************************
// Секция прототипов глобальных функций

//------------------------------------------------------------------------------
//  Прототипы функция для микроконтроллера серии "PIC24H"
#if defined(__dsPIC33F__) || defined(__PIC24H__) || defined(__dsPIC33E__) || defined(__PIC24E__) || \
    defined(__dsPIC30F1010__) || defined(__dsPIC30F2020__) || defined(__dsPIC30F2023__)

extern void PIC_USART_1_TransmitPackageWithOutInterrupt(uint8_t *pDataArr,
        size_t cnt);

extern void PIC_USART_4_TransmitPackageWithOutInterrupt(uint8_t *pDataArr,
        size_t cnt);

extern void PIC_Init_USART1_1StopBit_8BitData_RxIntEnChar_TxIntEn(unsigned long fcy,
        unsigned long baudrate);
extern void PIC_Init_USART4_1StopBit_8BitData_RxIntEnChar_TxIntEn(long fcy,
        unsigned long baudrate);
#endif //   defined(__dsPIC33F__) || defined(__PIC24H__) || defined(__dsPIC33E__) || defined(__PIC24E__) || 
//   defined(__dsPIC30F1010__) || defined(__dsPIC30F2020__) || defined(__dsPIC30F2023__)
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//******************************************************************************


//******************************************************************************
// Секция определения макросов
//******************************************************************************

#endif	/* LIB_H_PIC_UART_H */

////////////////////////////////////////////////////////////////////////////////
// END OF FILE
////////////////////////////////////////////////////////////////////////////////
