/** 
 * File:   Lib_H_PIC_uart.c
 * Author: Isaev
 *
 * Created on 8 октября 2017 г., 17:19
 */

//******************************************************************************
// Секция include: здесь подключается заголовочный файл к модулю
#include "Lib_H_PIC_uart.h"
//******************************************************************************


//******************************************************************************
//------------------------------------------------------------------------------
// Глобальные переменные
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
// Локальные переменные
//------------------------------------------------------------------------------
//******************************************************************************


//******************************************************************************
// Секция прототипов локальных функций
//******************************************************************************


//******************************************************************************
// Секция описания функций (сначала глобальных, потом локальных)
//==============================================================================

//------------------------------------------------------------------------------
// Функции для микроконтроллера серии "PIC24H"
#if defined (__PIC24H__)

void PIC_Init_USART1_1StopBit_8BitData_RxIntEnChar_TxIntEn(unsigned long fcy,
                                                           unsigned long baudrate)
{
    unsigned int U_MODE = UART_EN
            & UART_IDLE_CON
            & UART_IrDA_DISABLE
            & UART_MODE_FLOW
            & UART_UEN_00
            & UART_DIS_WAKE
            & UART_DIS_LOOPBACK
            & UART_DIS_ABAUD
            & UART_UXRX_IDLE_ONE
            & UART_BRGH_SIXTEEN
            & UART_NO_PAR_8BIT
            & UART_1STOPBIT;
    unsigned int UxSTA = UART_INT_TX
            & UART_IrDA_POL_INV_ZERO
            & UART_SYNC_BREAK_DISABLED
            & UART_TX_ENABLE
            & UART_INT_RX_BUF_FUL
            & UART_ADR_DETECT_DIS
            & UART_RX_OVERRUN_CLEAR;
    OpenUART1(U_MODE, UxSTA, ((fcy / baudrate) / 16) - 1);
    ConfigIntUART1(UART_RX_INT_EN & UART_RX_INT_PR4
                   & UART_TX_INT_EN & UART_TX_INT_PR4);
}
#endif
//------------------------------------------------------------------------------


//==============================================================================
//******************************************************************************


////////////////////////////////////////////////////////////////////////////////
// END OF FILE
////////////////////////////////////////////////////////////////////////////////
